Revit 2026 API

# DocumentNewCurtainSystem Method

---

Creates a new CurtainSystem element from a set of faces.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurtainSystem NewCurtainSystem(
	FaceArray faces,
	CurtainSystemType curtainSystemType
)
```
```vb
Public Function NewCurtainSystem (
	faces As FaceArray,
	curtainSystemType As CurtainSystemType
) As CurtainSystem
```
```cpp
public:
CurtainSystem^ NewCurtainSystem(
	FaceArray^ faces,
	CurtainSystemType^ curtainSystemType
)
```
```fsharp
member NewCurtainSystem :
        faces : FaceArray *
        curtainSystemType : CurtainSystemType -> CurtainSystem
```

#### Parameters

faces FaceArray
    The faces new CurtainSystem will be created on.
curtainSystemType CurtainSystemType
    The Type of CurtainSystem to be created.

#### Return Value

CurtainSystem The CurtainSystem created will be returned when the operation succeeds.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown in following cases: The input argument faces or curtainSystemType is . The size of faces is zero. |
| InvalidOperationException | Thrown when the CurtainSystem cannot be created or regenerate fails. |
| ArgumentException | Thrown if the curtain system type does not exist in the given document. |

The input faces will be copied during the operations so that they can be any faces.

#### Reference

Document Class

Autodesk.Revit.Creation Namespace